Autodesk.Revit.DB.Architecture.StairsRun.CreateSpiralRun(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.XYZ,System.Double,System.Double,System.Double,System.Boolean,Autodesk.Revit.DB.Architecture.StairsRunJustification)
Creates a spiral run in the project document by providing the center, start angle and included angle.
Remarks:
The new stairs run and the document will be regenerated.
This should be run from within an open transaction.
document:
The document.
stairsId:
The stairs that the new stairs run will belong to.
center:
The center of the location arc of the spiral run.
The Z coordinate of the center is the base elevation for the new run (in model coordinates).
It must be greater than or equal to the stairs base elevation.
radius:
The radius of the location arc of the spiral run.
startAngle:
The start angle of the location arc of the spiral run.
The angle's coordinate system is world coordinate system which always is XYZ.BasisX and XYZ.BasisY.
includedAngle:
The total angle covered by the spiral run. Must be a positive value (direction is determined by the clockwise flag).
clockwise:
True if the spiral run will be created along clockwise direction, False otherwise.
justification:
The location path justification of the new stairs run.
Returns:
The new stairs run.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The stairsId is not a valid stairs element.
-or-
The given value for startAngle is not finite
-or-
The input center is not a valid center for spiral run (probably the Z coordinate doesn't meet the restrictions)
-or-
The includedAngle doesn't satisfy riser restriction to generate spiral run (probably it's too small).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for radius must be greater than 0 and no more than 30000 feet.
-or-
The given value for includedAngle must be positive.
-or-
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
The radius is too small to generate a spiral run at the given justification.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The stairs element represented by stairsId is not in an active StairsEditScope.
New components cannot be added to it.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.RegenerationFailedException:
The center, radius, startAngle, includedAngle don't satisfy restrictions to generate spiral run.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsRun.CreateStraightRun(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Line,Autodesk.Revit.DB.Architecture.StairsRunJustification)
Creates a straight run in the project document.
Remarks:
The new stairs run and the document will be regenerated.
This should be run from within an open transaction.
document:
The document.
stairsId:
The stairs that the new stairs run will belong to.
locationPath:
The line for location path of the new stairs run. The line has following restriction:
The line should be bound line which is parallel to the XY plane.The Z coordinate of the line is the base elevation for the new run (in model coordinates).
It must be greater than or equal to the stairs base elevation.The number of created risers will be calculated by rounding the length of the
location path to a multiple of the tread depth.
justification:
The location path justification of the new stairs run.
Returns:
The new stairs run.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The stairsId is not a valid stairs element.
-or-
The input locationPath is not a bound line.
-or-
The input locationPath is not a valid location path line for straight run.
-or-
The locationPath is not valid line used as stairs path(probably it's too short).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The stairs element represented by stairsId is not in an active StairsEditScope.
New components cannot be added to it.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.RegenerationFailedException:
The locationPath doesn't satisfy restrictions to generate straight run.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsRun.CreateSketchedRunWithSlopeData(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.Double,System.Collections.Generic.IList{Autodesk.Revit.DB.SketchedStairsCurveData},System.Collections.Generic.IList{Autodesk.Revit.DB.Curve},System.Collections.Generic.IList{Autodesk.Revit.DB.Curve})
Creates a sketched run in the project document by providing a group of boundary curves and riser curves, specifying slope type and height for boundary curves.
Remarks:
The run type of the new stairs run will be determined by the specified stairs.
The new stairs run and the document will be regenerated.
This should be run from within an open transaction.
document:
The document.
stairsId:
The stairs that the new stairs run will belong to.
baseElevation:
Base elevation of the new stairs run. It has following restrictions:
The base elevation is relative to the base elevation of the stairs.The base elevation will be rounded automatically to a multiple of the riser height.
boundaryCurves:
The boundary curves of the new stairs run, specifying slope type and height. The curves have following restriction:
The curves should consist of bound Line or Arc curves only.The curves should be a pair of curve chains(two sets of curves which connect end-to-end
to form the left and right boundaries).The left and right boundary chain curves should not connect to each other.They can be single curves or multi-segmented curves(for example, straight lines and
arcs connected).
riserCurves:
The riser curves of the new stairs run. The curves have following restriction:
The curves should consist of bound Line or Arc curves only.The curves should be able to make at least two curve chains.The curves in each chain should connect between the left and right boundaries.
stairsPath:
The stair path curves of the new stairs run. The curves have following restriction:
The curves should consist of bound Line or Arc curves only.The curves should be able to make one curve chain.The curve chain should have intersection with all riser curve chains.The curves should connect between the first and last riser chain curves.
Returns:
The new stairs run.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The stairsId is not a valid stairs element.
-or-
The input riserCurves is empty.
-or-
The input stairsPath is empty.
-or-
The input boundaryCurves is empty.
The input boundaryCurves contains at least one curve which is not a bound Line or bound Arc
and is not supported for this operation.
-or-
The input riserCurves contains at least one curve which is not a bound Line or bound Arc
and is not supported for this operation.
-or-
The input stairsPath contains at least one curve which is not a bound Line or bound Arc
and is not supported for this operation.
-or-
The riserCurves or boundaryCurves or stairsPath don't meet restrictions to create sketch run.
-or-
The boundaryCurves has invalid curve used as sketch boundary curve.
-or-
The riserCurves has invalid curve used as sketch riser curve.
-or-
The stairsPath has invalid curve used as sketch stairspath curve.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for baseElevation must be no more than 30000 feet in absolute value.
-or-
The baseElevation doesn't meet the restriction that bottom of run should not be lower than bottom of stairs.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The stairs element represented by stairsId is not in an active StairsEditScope.
New components cannot be added to it.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.RegenerationFailedException:
The boundaryCurves, riserCurves, stairsPath don't meet restrictions to generate sketch run.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsRun.CreateSketchedRun(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.Double,System.Collections.Generic.IList{Autodesk.Revit.DB.Curve},System.Collections.Generic.IList{Autodesk.Revit.DB.Curve},System.Collections.Generic.IList{Autodesk.Revit.DB.Curve})
Creates a sketched run in the project document by providing a group of boundary curves and riser curves.
Remarks:
The run type of the new stairs run will be determined by the specified stairs.
The new stairs run and the document will be regenerated.
This should be run from within an open transaction.
document:
The document.
stairsId:
The stairs that the new stairs run will belong to.
baseElevation:
Base elevation of the new stairs run. It has following restrictions:
The base elevation is relative to the base elevation of the stairs.The base elevation will be rounded automatically to a multiple of the riser height.
boundaryCurves:
The boundary curves of the new stairs run. The curves have following restriction:
The curves should consist of bound Line or Arc curves only.The curves should be a pair of curve chains(two sets of curves which connect end-to-end
to form the left and right boundaries).The left and right boundary chain curves should not connect to each other.They can be single curves or multi-segmented curves(for example, straight lines and
arcs connected).
riserCurves:
The riser curves of the new stairs run. The curves have following restriction:
The curves should consist of bound Line or Arc curves only.The curves should be able to make at least two curve chains.The curves in each chain should connect between the left and right boundaries.
stairsPath:
The stair path curves of the new stairs run. The curves have following restriction:
The curves should consist of bound Line or Arc curves only.The curves should be able to make one curve chain.The curve chain should have intersection with all riser curve chains.The curves should connect between the first and last riser chain curves.
Returns:
The new stairs run.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The stairsId is not a valid stairs element.
-or-
The input boundaryCurves is empty.
-or-
The input riserCurves is empty.
-or-
The input stairsPath is empty.
-or-
The input boundaryCurves contains at least one curve which is not a bound Line or bound Arc
and is not supported for this operation.
-or-
The input riserCurves contains at least one curve which is not a bound Line or bound Arc
and is not supported for this operation.
-or-
The input stairsPath contains at least one curve which is not a bound Line or bound Arc
and is not supported for this operation.
-or-
The riserCurves or boundaryCurves or stairsPath don't meet restrictions to create sketch run.
-or-
The boundaryCurves has invalid curve used as sketch boundary curve.
-or-
The riserCurves has invalid curve used as sketch riser curve.
-or-
The stairsPath has invalid curve used as sketch stairspath curve.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for baseElevation must be no more than 30000 feet in absolute value.
-or-
The baseElevation doesn't meet the restriction that bottom of run should not be lower than bottom of stairs.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The stairs element represented by stairsId is not in an active StairsEditScope.
New components cannot be added to it.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.RegenerationFailedException:
The boundaryCurves, riserCurves, stairsPath don't meet restrictions to generate sketch run.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsRun.SetLocationPathForSpiralRun(Autodesk.Revit.DB.Architecture.StairsRun,Autodesk.Revit.DB.XYZ,System.Double,System.Double,System.Double,System.Boolean,Autodesk.Revit.DB.Architecture.StairsRunJustification)
Set Location path for a spiral run.
stairsRun:
The run whose location path will be set.
center:
The center of the location arc of the spiral run.
The Z coordinate of the center is the base elevation for the new run (in model coordinates).
It must be greater than or equal to the stairs base elevation.
radius:
The radius of the location arc of the spiral run.
startAngle:
The start angle of the location arc of the spiral run.
The angle's coordinate system is world coordinate system which always is XYZ.BasisX and XYZ.BasisY.
includedAngle:
The total angle covered by the spiral run. Must be a positive value (direction is determined by the clockwise flag).
clockwise:
True if the spiral run will be created along clockwise direction, False otherwise.
justification:
The location path justification of the new stairs run.
Returns:
Indicate if set is success or not.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for startAngle is not finite
-or-
The input center is not a valid center for spiral run (probably the Z coordinate doesn't meet the restrictions)
-or-
The includedAngle doesn't satisfy riser restriction to generate spiral run (probably it's too small).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for radius must be greater than 0 and no more than 30000 feet.
-or-
The given value for includedAngle must be positive.
-or-
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
The radius is too small to generate a spiral run at the given justification.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The stairs element represented by stairsRun is not in an active StairsEditScope.
The run cannot be modified.
Throws Autodesk.Revit.Exceptions.RegenerationFailedException:
The center, radius, startAngle, includedAngle don't satisfy restrictions to generate spiral run.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsRun.SetLocationPathForStraightRun(Autodesk.Revit.DB.Architecture.StairsRun,Autodesk.Revit.DB.Line)
Set location path for a straight run by giving a line.
stairsRun:
The run whose location path will be set.
locationPath:
The location path.
Returns:
Indicate if set is success or not.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input locationPath is not a bound line.
-or-
The input locationPath is not a valid location path line for straight run.
-or-
The locationPath is not valid line used as stairs path(probably it's too short).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The stairs element represented by stairsRun is not in an active StairsEditScope.
The run cannot be modified.
Throws Autodesk.Revit.Exceptions.RegenerationFailedException:
The locationPath doesn't satisfy restrictions to generate straight run.
Since:
2013